import React from "react";

const TermsOfServiceContent = () => {
  return (
    <div>
      <h5>제1조 (목적)</h5>
      <p>
        이 약관은 회사가 제공하는 서비스의 이용과 관련하여 회사와 회원과의 권리, 의무 및 책임사항,
        기타 필요한 사항을 규정함을 목적으로 합니다.
      </p>

      <br />
      <br />

      <h5>제2조 (정의)</h5>
      <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
      <ul>
        <li>&quot;서비스&quot;라 함은 회사가 제공하는 모든 제반 서비스를 의미합니다.</li>
        <li>
          &quot;회원&quot;이라 함은 회사의 서비스에 접속하여 이 약관에 따라 회사와 이용계약을
          체결하고 회사가 제공하는 서비스를 이용하는 고객을 말합니다.
        </li>
        <li>
          &quot;계정&quot;이라 함은 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는
          이메일 주소를 의미합니다.
        </li>
      </ul>

      <br />

      <h5>제3조 (약관의 게시와 개정)</h5>
      <p>
        회사는 이 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시합니다. 회사는
        &quot;약관의 규제에 관한 법률&quot;, &quot;정보통신망 이용촉진 및 정보보호 등에 관한
        법률(이하 &quot;정보통신망법&quot;)&quot; 등 관련법을 위배하지 않는 범위에서 이 약관을
        개정할 수 있습니다.
      </p>

      <br />
      <br />

      <h5>제4조 (이용계약 체결)</h5>
      <p>
        이용계약은 회원이 되고자 하는 자(이하 &quot;가입신청자&quot;)가 약관의 내용에 대하여 동의를
        한 다음 회원가입신청을 하고 회사가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
      </p>

      <br />
      <br />

      <h5>제5조 (회사의 의무)</h5>
      <p>
        회사는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고
        안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
      </p>

      <br />

      <h5>제6조 (회원의 의무)</h5>
      <p>회원은 다음 행위를 하여서는 안 됩니다.</p>
      <ol>
        <li>신청 또는 변경 시 허위 내용의 등록</li>
        <li>타인의 정보 도용</li>
        <li>회사가 게시한 정보의 변경</li>
        <li>회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해</li>
        <li>회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위</li>
      </ol>

      <br />

      <h5>제7조 (서비스의 제공 등)</h5>
      <p>
        회사는 회원에게 아래와 같은 서비스를 제공합니다. 서비스는 연중무휴, 1일 24시간 제공함을
        원칙으로 합니다. 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신두절 또는
        운영상 상당한 이유가 있는 경우 서비스의 제공을 일시적으로 중단할 수 있습니다.
      </p>

      <br />
      <br />

      <h5>제8조 (서비스의 변경)</h5>
      <p>
        회사는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에 따라 제공하고 있는 전부 또는 일부
        서비스를 변경할 수 있습니다.
      </p>

      <br />
      <br />

      <h5>제9조 (계약해제, 해지 등)</h5>
      <p>
        회원은 언제든지 서비스 내 정보 관리 메뉴를 통하여 이용계약 해지 신청을 할 수 있으며, 회사는
        관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
      </p>
    </div>
  );
};

export default TermsOfServiceContent;
